; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-3-8)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 - object)
(:init
(at-robby robot1 room1)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room2)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room3)
(at ball2 room3)
(at ball3 room2)
(at ball4 room1)
(at ball5 room1)
(at ball6 room2)
(at ball7 room3)
(at ball8 room2)
)
(:goal
(and
(at ball1 room3)
(at ball2 room2)
(at ball3 room2)
(at ball4 room2)
(at ball5 room1)
(at ball6 room3)
(at ball7 room1)
(at ball8 room2)
)
)
)

; plan
1. (pick robot2 ball6 room2 lgripper2)
   deleted: (at ball6 room2) (free robot2 lgripper2)
   added: (carry robot2 ball6 lgripper2)
   goals met: 4 of 8
2. (pick robot1 ball4 room1 lgripper1)
   deleted: (at ball4 room1) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 4 of 8
3. (move robot2 room2 room3)
   deleted: (at-robby robot2 room2)
   added: (at-robby robot2 room3)
   goals met: 4 of 8
4. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 4 of 8
5. (drop robot2 ball6 room3 lgripper2)
   deleted: (carry robot2 ball6 lgripper2)
   added: (at ball6 room3) (free robot2 lgripper2)
   goals met: 5 of 8
6. (pick robot1 ball2 room3 rgripper1)
   deleted: (at ball2 room3) (free robot1 rgripper1)
   added: (carry robot1 ball2 rgripper1)
   goals met: 5 of 8
7. (pick robot2 ball7 room3 rgripper2)
   deleted: (at ball7 room3) (free robot2 rgripper2)
   added: (carry robot2 ball7 rgripper2)
   goals met: 5 of 8
8. (move robot1 room3 room2)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room2)
   goals met: 5 of 8
9. (move robot2 room3 room1)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room1)
   goals met: 5 of 8
10. (drop robot1 ball4 room2 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room2) (free robot1 lgripper1)
   goals met: 6 of 8
11. (drop robot1 ball2 room2 rgripper1)
   deleted: (carry robot1 ball2 rgripper1)
   added: (at ball2 room2) (free robot1 rgripper1)
   goals met: 7 of 8
12. (drop robot2 ball7 room1 rgripper2)
   deleted: (carry robot2 ball7 rgripper2)
   added: (at ball7 room1) (free robot2 rgripper2)
   goals met: 8 of 8
